Tekla Open API Reference for Tekla Structures 2025
PourObject.Delete Method
 At the moment pour objects cannot be deleted.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public override bool Delete()
Public Overrides Function Delete As Boolean
Return Value
Type: Boolean
Returns false.
See Also
Reference
PourObject Class
Tekla.Structures.Model Namespace